export const ADVANTAGES = [
  {
    icon: '\u{1F5C2}\u{FE0F}',
    title: 'Устранение избыточности данных',
  },
  {
    icon: '\u{1F6E1}\u{FE0F}',
    title: 'Повышение целостности и точности',
  },
  {
    icon: '\u{2699}\u{FE0F}',
    title: 'Упрощение модификации и масштабирования',
  },
  {
    icon: '\u{1F4C9}',
    title: 'Минимизация ошибок за счет автоматизации',
  },
  {
    icon: '\u{26D3}\u{FE0F}\u{200D}\u{1F4A5}',
    title: 'Без привязки к СУБД',
  },
  {
    icon: '\u{26A1}',
    title: 'Быстро и просто',
  },
];

export const STEPS = [
  {
    icon: '\u{1F464}',
    title: 'Регистрация/вход',
    desc: 'С помощью электронной почты создайте аккаунт или войдите в существующий, чтобы получить доступ к функционалу нормализации',
  },
  {
    icon: '\u{1F4DD}',
    title: 'Ввод структуры базы данных',
    desc: 'Задайте отношения, атрибуты - не забудьте указать первичные и внешние ключи - и функциональные зависимости. Типы данных и данные не нужны',
  },
  {
    icon: '\u{1FA84}',
    title: 'Нормализация',
    desc: 'Убедитесь, что введены все функциональные зависимости, и нажмите "Нормализовать" — алгоритм проверит схему на соответствие 3НФ',
  },
  {
    icon: '\u{2714}',
    title: 'Результат',
    desc: 'Ознакомьтесь с новой, нормализованной структурой базы данных',
  },
];
